micro_pillars_2D_case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     icoUncoupledKinematicParcelFoam;

libs ("liblagrangian.so");

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2;

deltaT          0.001;

writeControl    timeStep;
writeInterval   200;

purgeWrite      0;

functions
{
    cloudWrite
    {
        type vtkCloud;
        libs ("liblagrangianFunctionObjects.so");

        writeControl timeStep;     // ✅ IMPORTANT
        writeInterval 50;          // write particles frequently
    }
}