micro_pillars_2D_case/system/blockMeshDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1e-3;

vertices
(
    (0 0 0)
    (1000 0 0)
    (1000 200 0)
    (0 200 0)

    (0 0 1)
    (1000 0 1)
    (1000 200 1)
    (0 200 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (300 80 1)
    simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 7 4));
    }

    outlet
    {
        type patch;
        faces ((1 5 6 2));
    }

    walls
    {
        type wall;
        faces ((0 1 5 4) (3 2 6 7));
    }

    frontAndBack
    {
        type empty;
        faces ((0 1 2 3) (4 5 6 7));
    }
);
