micro_pillars_2D_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          63;
        startFace       46712;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       46775;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          545;
        startFace       46855;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          46042;
        startFace       47400;
    }
    pillars
    {
        type            wall;
        inGroups        1(wall);
        nFaces          364;
        startFace       93442;
    }
)

// ************************************************************************* //
