micro_pillars_2D_case/constant/kinematicCloudProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kinematicCloudProperties;
}

cloudName      kinematicCloud;

solution
{
    active                  true;
    coupled                 false;
    transient               true;
    maxCo                   0.3;

    cellValueSourceCorrection off;

    integrationSchemes
    {
        U               Euler;
    }

    interpolationSchemes
    {
        U               cell;
        rho             cell;
        mu              cell;     // ✅ added
        nu              cell;     // ✅ added (some builds use this instead)
    }
}

constantProperties
{
    rho0        1000;
}

subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }

    injectionModels
    {
        injector1
        {
            type            patchInjection;

            patch           inlet;

            SOI             0;
            duration        1;

            parcelsPerSecond 1000;
            massTotal       1e-9;

            parcelBasisType mass;

            U0              (0.01 0 0);

            flowRateProfile constant 1;

            sizeDistribution
            {
                type fixedValue;
                fixedValueDistribution
                {
                    value 2.5e-6;
                }
            }
        }
    }

    dispersionModel          none;
    patchInteractionModel    none;
    stochasticCollisionModel none;
    surfaceFilmModel         none;
    collisionModel           none;
}