micro_pillars_2D_case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.01 0 0);

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (0.01 0 0);
    }

    outlet
    {
        type zeroGradient;
    }

    walls
    {
        type noSlip;
    }

    frontAndBack
    {
        type empty;
    }

    pillars
    {
        type noSlip;
    }
}